EMU/cscdw/ExsysEsb/src/jbiasa/ExsysEsb.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="ExsysEsb"
             xmlns:tns="ExsysEsb" xmlns:ns="http://ws.dw.csc.cms.cern.org/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://ws.dw.csc.cms.cern.org/" location="../jbiServiceUnits/ExsysEsbBpel/CdwWS/Cdw.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:factcollection">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="input">
            <soap:operation/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
            <fault name="Exception">
                <soap:fault name="Exception" use="literal"/>
            </fault>
        </operation>
    </binding>
    <service name="ExsysEsbService1">
        <port name="cdwFactCollectionInputPort" binding="tns:casaBinding1">
            <soap:address location="http://macfrank:18080/cdw/factcollection"/>
        </port>
    </service>
</definitions>

