EMU/cscdw/CdwWS/src/java/org/cern/cms/csc/dw/ws/test/localDqmMessage.xml

<?xml version="1.0" encoding="UTF-8"?>

<soapenv:Envelope 
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ws="http://ws.dw.csc.cms.cern.org/"
    xmlns:ser="http://www.cern.ch/cms/csc/dw/service"
    xmlns:mod="http://www.cern.ch/cms/csc/dw/model">
   <soapenv:Header>
   </soapenv:Header>
   <soapenv:Body>
      <ws:input>
         <factCollection>
            <ser:serviceInstructions async="false" strict="true" persist="true"/>
            <mod:source>LOCAL_DQM</mod:source>
            <mod:DqmDduFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>DDU01</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>INFO</mod:severity>
               <mod:online>true</mod:online>
               <mod:DDU_WITH_FORMAT_ERRORS>123</mod:DDU_WITH_FORMAT_ERRORS>
               <mod:DDU_WITH_FORMAT_ERRORS_F>13.5</mod:DDU_WITH_FORMAT_ERRORS_F>
               <mod:DDU_WITH_TRAILER_ERRORS>234</mod:DDU_WITH_TRAILER_ERRORS>
               <mod:DDU_WITH_TRAILER_ERRORS_F>15.53</mod:DDU_WITH_TRAILER_ERRORS_F>
            </mod:DqmDduFact>
            <mod:DqmDduFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>DDU02</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>INFO</mod:severity>
               <mod:online>true</mod:online>
               <mod:DDU_WITH_FORMAT_ERRORS>123</mod:DDU_WITH_FORMAT_ERRORS>
               <mod:DDU_WITH_FORMAT_ERRORS_F>13.5</mod:DDU_WITH_FORMAT_ERRORS_F>
               <mod:DDU_WITH_TRAILER_ERRORS>234</mod:DDU_WITH_TRAILER_ERRORS>
               <mod:DDU_WITH_TRAILER_ERRORS_F>15.53</mod:DDU_WITH_TRAILER_ERRORS_F>
            </mod:DqmDduFact>
            <mod:DqmDduFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>DDU03</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>INFO</mod:severity>
               <mod:online>true</mod:online>
               <mod:DDU_WITH_FORMAT_ERRORS>123</mod:DDU_WITH_FORMAT_ERRORS>
               <mod:DDU_WITH_FORMAT_ERRORS_F>13.5</mod:DDU_WITH_FORMAT_ERRORS_F>
               <mod:DDU_WITH_TRAILER_ERRORS>234</mod:DDU_WITH_TRAILER_ERRORS>
               <mod:DDU_WITH_TRAILER_ERRORS_F>15.53</mod:DDU_WITH_TRAILER_ERRORS_F>
            </mod:DqmDduFact>
            <mod:DqmDduFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>DDU04</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>INFO</mod:severity>
               <mod:online>true</mod:online>
               <mod:DDU_WITH_FORMAT_ERRORS>123</mod:DDU_WITH_FORMAT_ERRORS>
               <mod:DDU_WITH_FORMAT_ERRORS_F>13.5</mod:DDU_WITH_FORMAT_ERRORS_F>
               <mod:DDU_WITH_TRAILER_ERRORS>234</mod:DDU_WITH_TRAILER_ERRORS>
               <mod:DDU_WITH_TRAILER_ERRORS_F>15.53</mod:DDU_WITH_TRAILER_ERRORS_F>
            </mod:DqmDduFact>
            <mod:DqmDduInputFact>
               <mod:time>2010-02-01T01:01:04</mod:time>
               <mod:component_id>DDU01Input2</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>INFO</mod:severity>
               <mod:online>true</mod:online>
               <mod:DDU_INPUT_IN_ERROR_STATE>12344444</mod:DDU_INPUT_IN_ERROR_STATE>
               <mod:DDU_INPUT_IN_WARNING_STATE>45345345</mod:DDU_INPUT_IN_WARNING_STATE>
               <mod:DDU_NO_INPUT_DATA>34534</mod:DDU_NO_INPUT_DATA>
            </mod:DqmDduInputFact>
            <mod:DqmCscAfebFact>
               <mod:time>2010-02-01T01:02:03</mod:time>
               <mod:component_id>ME-1/1/02/AFEB1</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>TOLERABLE</mod:severity>
               <mod:online>true</mod:online>
               <mod:CSC_ALCT_AFEB_NOISY>1231244</mod:CSC_ALCT_AFEB_NOISY>
               <mod:CSC_ALCT_NO_ANODE_DATA>123214312</mod:CSC_ALCT_NO_ANODE_DATA>
            </mod:DqmCscAfebFact>
            <mod:DqmCscCfebFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>ME-1/1/02/CFEB1</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>TOLERABLE</mod:severity>
               <mod:online>true</mod:online>
               <mod:CSC_WITH_LOW_CFEB_DAV_EFF></mod:CSC_WITH_LOW_CFEB_DAV_EFF>
               <mod:CSC_WITH_LOW_CFEB_DAV_EFF_F></mod:CSC_WITH_LOW_CFEB_DAV_EFF_F>
            </mod:DqmCscCfebFact>
            <mod:DqmEmuFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>ME</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>TOLERABLE</mod:severity>
               <mod:online>true</mod:online>
               <mod:ALL_CHAMBER_EVENTS_AVERAGE>12312</mod:ALL_CHAMBER_EVENTS_AVERAGE>
               <mod:ALL_CHAMBER_EVENTS_COUNTER>123123</mod:ALL_CHAMBER_EVENTS_COUNTER>
               <mod:ALL_CHAMBERS_WITH_BWORDS>34534</mod:ALL_CHAMBERS_WITH_BWORDS>
               <mod:ALL_CHAMBERS_WITH_FORMAT_ERRORS>345345</mod:ALL_CHAMBERS_WITH_FORMAT_ERRORS>
               <mod:ALL_CHAMBERS_WITH_INPUT_FIFO_FULL>345345</mod:ALL_CHAMBERS_WITH_INPUT_FIFO_FULL>
               <mod:ALL_CHAMBERS_WITH_INPUT_TIMEOUT>345345</mod:ALL_CHAMBERS_WITH_INPUT_TIMEOUT>
               <mod:ALL_CHAMBERS_WITH_L1A_OUT_OF_SYNC>345345</mod:ALL_CHAMBERS_WITH_L1A_OUT_OF_SYNC>
               <mod:ALL_CHAMBERS_WITHOUT_ALCT>34534</mod:ALL_CHAMBERS_WITHOUT_ALCT>
               <mod:ALL_CHAMBERS_WITHOUT_CFEB>345345</mod:ALL_CHAMBERS_WITHOUT_CFEB>
               <mod:ALL_CHAMBERS_WITHOUT_CLCT>345345</mod:ALL_CHAMBERS_WITHOUT_CLCT>
               <mod:ALL_CHAMBERS_WITHOUT_DATA>345345</mod:ALL_CHAMBERS_WITHOUT_DATA>
               <mod:ALL_DDU_EVENTS_AVERAGE>2342</mod:ALL_DDU_EVENTS_AVERAGE>
               <mod:ALL_DDU_EVENTS_COUNTER>111</mod:ALL_DDU_EVENTS_COUNTER>
               <mod:ALL_DDU_IN_READOUT>23</mod:ALL_DDU_IN_READOUT>
               <mod:ALL_DDU_INPUT_IN_ERROR_STATE>234</mod:ALL_DDU_INPUT_IN_ERROR_STATE>
               <mod:ALL_DDU_INPUT_IN_WARNING_STATE>234</mod:ALL_DDU_INPUT_IN_WARNING_STATE>
               <mod:ALL_DDU_WITH_DATA>234</mod:ALL_DDU_WITH_DATA>
               <mod:ALL_DDU_WITH_FORMAT_ERRORS>234</mod:ALL_DDU_WITH_FORMAT_ERRORS>
               <mod:ALL_DDU_WITH_INPUT_IN_ERROR_STATE>22</mod:ALL_DDU_WITH_INPUT_IN_ERROR_STATE>
               <mod:ALL_DDU_WITH_INPUT_IN_WARN_STATE>22</mod:ALL_DDU_WITH_INPUT_IN_WARN_STATE>
               <mod:ALL_DDU_WITH_LIVE_INPUTS>22</mod:ALL_DDU_WITH_LIVE_INPUTS>
               <mod:ALL_HOT_CHAMBERS>1</mod:ALL_HOT_CHAMBERS>
               <mod:ALL_HOT_DDU_IN_READOUT>11</mod:ALL_HOT_DDU_IN_READOUT>
               <mod:ALL_LOW_DDU_IN_READOUT>23</mod:ALL_LOW_DDU_IN_READOUT>
               <mod:ALL_LOW_EFF_CHAMBERS>12</mod:ALL_LOW_EFF_CHAMBERS>
               <mod:ALL_NO_DDU_IN_READOUT>12</mod:ALL_NO_DDU_IN_READOUT>
            </mod:DqmEmuFact>
            <mod:DqmCscFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>ME-1/1/02</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>TOLERABLE</mod:severity>
               <mod:online>true</mod:online>
               <mod:CSC_FORMAT_ERRORS_BIT1>123</mod:CSC_FORMAT_ERRORS_BIT1>
               <mod:CSC_FORMAT_ERRORS_BIT1_F>11.5</mod:CSC_FORMAT_ERRORS_BIT1_F>
               <mod:CSC_FORMAT_ERRORS_BIT10>123</mod:CSC_FORMAT_ERRORS_BIT10>
               <mod:CSC_FORMAT_ERRORS_BIT10_F>11.5</mod:CSC_FORMAT_ERRORS_BIT10_F>
               <mod:CSC_FORMAT_ERRORS_BIT11>44</mod:CSC_FORMAT_ERRORS_BIT11>
               <mod:CSC_FORMAT_ERRORS_BIT11_F>11.5</mod:CSC_FORMAT_ERRORS_BIT11_F>
               <mod:CSC_FORMAT_ERRORS_BIT12>33</mod:CSC_FORMAT_ERRORS_BIT12>
               <mod:CSC_FORMAT_ERRORS_BIT12_F>11.5</mod:CSC_FORMAT_ERRORS_BIT12_F>
               <mod:CSC_FORMAT_ERRORS_BIT13>12</mod:CSC_FORMAT_ERRORS_BIT13>
               <mod:CSC_FORMAT_ERRORS_BIT13_F>11.5</mod:CSC_FORMAT_ERRORS_BIT13_F>
               <mod:CSC_FORMAT_ERRORS_BIT14>1</mod:CSC_FORMAT_ERRORS_BIT14>
               <mod:CSC_FORMAT_ERRORS_BIT14_F>11.5</mod:CSC_FORMAT_ERRORS_BIT14_F>
               <mod:CSC_FORMAT_ERRORS_BIT15>22</mod:CSC_FORMAT_ERRORS_BIT15>
               <mod:CSC_FORMAT_ERRORS_BIT15_F>11.5</mod:CSC_FORMAT_ERRORS_BIT15_F>
               <mod:CSC_FORMAT_ERRORS_BIT16>443</mod:CSC_FORMAT_ERRORS_BIT16>
               <mod:CSC_FORMAT_ERRORS_BIT16_F>11.5</mod:CSC_FORMAT_ERRORS_BIT16_F>
               <mod:CSC_FORMAT_ERRORS_BIT17>234</mod:CSC_FORMAT_ERRORS_BIT17>
               <mod:CSC_FORMAT_ERRORS_BIT17_F>11.5</mod:CSC_FORMAT_ERRORS_BIT17_F>
               <mod:CSC_FORMAT_ERRORS_BIT18>11</mod:CSC_FORMAT_ERRORS_BIT18>
               <mod:CSC_FORMAT_ERRORS_BIT18_F>11.5</mod:CSC_FORMAT_ERRORS_BIT18_F>
               <mod:CSC_FORMAT_ERRORS_BIT19>456</mod:CSC_FORMAT_ERRORS_BIT19>
               <mod:CSC_FORMAT_ERRORS_BIT19_F>11.5</mod:CSC_FORMAT_ERRORS_BIT19_F>
               <mod:CSC_FORMAT_ERRORS_BIT2>234</mod:CSC_FORMAT_ERRORS_BIT2>
               <mod:CSC_FORMAT_ERRORS_BIT2_F>11.5</mod:CSC_FORMAT_ERRORS_BIT2_F>
               <mod:CSC_FORMAT_ERRORS_BIT3>22</mod:CSC_FORMAT_ERRORS_BIT3>
               <mod:CSC_FORMAT_ERRORS_BIT3_F>11.5</mod:CSC_FORMAT_ERRORS_BIT3_F>
               <mod:CSC_FORMAT_ERRORS_BIT4>11</mod:CSC_FORMAT_ERRORS_BIT4>
               <mod:CSC_FORMAT_ERRORS_BIT4_F>11.5</mod:CSC_FORMAT_ERRORS_BIT4_F>
               <mod:CSC_FORMAT_ERRORS_BIT5>11</mod:CSC_FORMAT_ERRORS_BIT5>
               <mod:CSC_FORMAT_ERRORS_BIT5_F>11.5</mod:CSC_FORMAT_ERRORS_BIT5_F>
               <mod:CSC_FORMAT_ERRORS_BIT6>77</mod:CSC_FORMAT_ERRORS_BIT6>
               <mod:CSC_FORMAT_ERRORS_BIT6_F>11.5</mod:CSC_FORMAT_ERRORS_BIT6_F>
               <mod:CSC_FORMAT_ERRORS_BIT7>6</mod:CSC_FORMAT_ERRORS_BIT7>
               <mod:CSC_FORMAT_ERRORS_BIT7_F>11.5</mod:CSC_FORMAT_ERRORS_BIT7_F>
               <mod:CSC_FORMAT_ERRORS_BIT8>45</mod:CSC_FORMAT_ERRORS_BIT8>
               <mod:CSC_FORMAT_ERRORS_BIT8_F>11.5</mod:CSC_FORMAT_ERRORS_BIT8_F>
               <mod:CSC_FORMAT_ERRORS_BIT9>45</mod:CSC_FORMAT_ERRORS_BIT9>
               <mod:CSC_FORMAT_ERRORS_BIT9_F>11.5</mod:CSC_FORMAT_ERRORS_BIT9_F>
               <mod:CSC_HOT_CHAMBER>1</mod:CSC_HOT_CHAMBER>
               <mod:CSC_HOT_CHAMBER_F>1.5</mod:CSC_HOT_CHAMBER_F>
               <mod:CSC_LOW_EFF_CHAMBER>12</mod:CSC_LOW_EFF_CHAMBER>
               <mod:CSC_LOW_EFF_CHAMBER_F>1</mod:CSC_LOW_EFF_CHAMBER_F>
               <mod:CSC_WITH_BWORDS>111</mod:CSC_WITH_BWORDS>
               <mod:CSC_WITH_BWORDS_F>2321</mod:CSC_WITH_BWORDS_F>
               <mod:CSC_WITH_FORMAT_ERRORS>122</mod:CSC_WITH_FORMAT_ERRORS>
               <mod:CSC_WITH_FORMAT_ERRORS_F>12.0</mod:CSC_WITH_FORMAT_ERRORS_F>
               <mod:CSC_WITH_INPUT_FIFO_FULL>111</mod:CSC_WITH_INPUT_FIFO_FULL>
               <mod:CSC_WITH_INPUT_FIFO_FULL_F>4.6</mod:CSC_WITH_INPUT_FIFO_FULL_F>
               <mod:CSC_WITH_INPUT_TIMEOUT>111</mod:CSC_WITH_INPUT_TIMEOUT>
               <mod:CSC_WITH_INPUT_TIMEOUT_F>3.1</mod:CSC_WITH_INPUT_TIMEOUT_F>
               <mod:CSC_WITH_L1A_OUT_OF_SYNC>12</mod:CSC_WITH_L1A_OUT_OF_SYNC>
               <mod:CSC_WITH_L1A_OUT_OF_SYNC_F>1.11</mod:CSC_WITH_L1A_OUT_OF_SYNC_F>
               <mod:CSC_WITHOUT_ALCT>11</mod:CSC_WITHOUT_ALCT>
               <mod:CSC_WITHOUT_ALCT_F>13.9</mod:CSC_WITHOUT_ALCT_F>
               <mod:CSC_WITHOUT_CFEB>11</mod:CSC_WITHOUT_CFEB>
               <mod:CSC_WITHOUT_CFEB_F>1.11</mod:CSC_WITHOUT_CFEB_F>
               <mod:CSC_WITHOUT_CLCT>22</mod:CSC_WITHOUT_CLCT>
               <mod:CSC_WITHOUT_CLCT_F>2.22</mod:CSC_WITHOUT_CLCT_F>
            </mod:DqmCscFact>
            <mod:DqmCscHvSegmentFact>
               <mod:time>2010-01-02T01:01:03</mod:time>
               <mod:component_id>ME+1/2/01/4/HVSegment1</mod:component_id>
               <mod:run>1234567</mod:run>
               <mod:severity>TOLERABLE</mod:severity>
               <mod:online>true</mod:online>
               <mod:CSC_NO_HV_SEGMENT>12344</mod:CSC_NO_HV_SEGMENT>
            </mod:DqmCscHvSegmentFact>
         </factCollection>
      </ws:input>
   </soapenv:Body>
</soapenv:Envelope>